tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.h
/*
 * Copyright 2021-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_NETC_SWITCH_H_
#define FSL_NETC_SWITCH_H_

#include "fsl_netc.h"
#include "fsl_netc_endpoint.h"
#include "fsl_netc_tag.h"
#include "netc_hw/fsl_netc_hw.h"
#include "netc_hw/fsl_netc_hw_enetc.h"
#include "netc_hw/fsl_netc_hw_port.h"
#include "netc_hw/fsl_netc_hw_si.h"

#if defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG
#ifndef NETC_SWITCH_ID
#define NETC_SWITCH_ID (1U)
#endif
#endif
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region api_swt
#endif
//////////////////////////////////////
// Group for the Switch Driver
//////////////////////////////////////
/*!
 * @defgroup netc_swt NETC SWITCH (SWT) Driver
 * @details This is the group of data structure/functions for the NETC switch
 * drivers.
 * This group handles switch devices covering the features to Initialize/De-Initialize the switch, transfer
 * packets, configure the port/links, and get the status and statistic. Note that it doesn't cover the phy configuration
 * which shall be configured in MDIO module for both external PHY and internal (virtual) PHY.
 *
 * The switch API mainly relates to the SWITCH IP which provides IEEE 802.1Q functionalities.
 *
 * APIs in this group take the swt_handle_t as first parameter to retrieve the current context.
 * User shall not manipulate the members of the handle without invoking the provided APIs or help macros as it may
 * break the driver state.
 *
 * All API in this groups start with `SWT_` and data structure specific to switch start with `swt_`.
 *
 * @ingroup netc_api
 */
/*!
 * @defgroup netc_swt_init Switch (SWT) Generic Configuration
 * @details Generic Ethernet switch configuration
 * MAC, host interface and driver configuration.
 * @ingroup netc_swt
 */
/*!
 * @defgroup netc_swt_ntmp Switch (SWT) Table Management Module
 * @details Generic Table Management related functionalities
 * @ingroup netc_swt
 */
/*!
 * @defgroup netc_swt_interrupt Switch (SWT) Interrupt Module
 * @details Interrupt related functionalities
 * @ingroup netc_swt
 */
/*!
 * @defgroup netc_swt_xfer Switch (SWT) Transmit/Receive
 * @details Data interface for transmit and receive
 * @ingroup netc_swt
 */
/*!
 * @defgroup netc_swt_datapath Switch (SWT) data path
 * @details QoS, classification and filtering functionalities
 * @ingroup netc_swt
 */
/*!
 * @defgroup netc_swt_stat Switch (SWT) Statistic Module
 * @details Statistics counters
 * @ingroup netc_swt
 */
/*!
 * @defgroup netc_swt_tx Switch (SWT) Egress data path configuration
 * @details API/Data structure for configuration of the endpoint ingress datapath
 * This module includes steps below in sequence and APIs are placed following this sequence for user to identify easily
 * - EPP : Egress Packet Processing
 * - CBS: Credit Based Shaper also referred as IEEE 802.1 Qav
 * - TGS: Time Gate Scheduling referred as IEEE 802.1 Qbv
 * - ETM : Egress Queuing and Traffic Management
 *
 * API in this group starts with `SWT_Tx`.
 *
 * @ingroup netc_swt_datapath
 */
/*!
 * @defgroup netc_swt_rx Switch (SWT) Ingress data path configuration
 * @details API/Data structure for configuration of the switch ingress datapath
 * This module includes steps below in sequence and APIs are placed following this sequence for user to identify easily
 * - Parser
 * - VLAN Classification
 * - Ingress QoS Classification
 * - IPF : Ingress Port Filtering
 * - PSFP : Per-Stream Filtering and Policing
 *   - Stream Identification and Filtering
 *   - Policying: Rate Policing and Stream Gating
 * - L2 Filtering: VLAN/MAC Address
 * - Enqueue (Ingress Congestion Management ICM)
 *
 * API in this group starts with `SWT_Rx`.
 *
 * @ingroup netc_swt_datapath
 */

/*!
 * @defgroup netc_swt_mgt Switch (SWT) management
 * @details Specific switch management and the Rx/Tx sharing features (e.g FDB)
 * - FM : Ingress/Egress Frame modification
 * - FRER : Frame Replication and Elimination for Reliability sequence generation
 * @ingroup netc_swt
 */

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion api_swt
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_init
#endif
/*! @addtogroup netc_swt_init
 * @{
 */
typedef struct _swt_handle swt_handle_t;
typedef struct _swt_transfer_config swt_transfer_config_t;

/*! @brief Callback for reclaimed tx frames */
typedef status_t (*swt_reclaim_cb_t)(swt_handle_t *handle, netc_tx_frame_info_t *frameInfo, void *userData);
/*! @brief Defines the Switch Rx memory buffer alloc function pointer. */
typedef void *(*swt_rx_alloc_cb_t)(swt_handle_t *handle, uint32_t length, void *userData);

/*! @brief Defines the Switch Rx memory buffer free function pointer. */
typedef void (*swt_rx_free_cb_t)(swt_handle_t *handle, void *address, void *userData);

/*! @brief Configuration structure for Switch */
typedef struct _swt_config
{
    netc_hw_switch_idx_t switchIdx; /*!< Switch index */
    struct
    {
        netc_port_ethmac_t ethMac;               /*!< Ethernet MAC configuration, vaild only on port 0 ~ 3 */
        netc_port_common_t commonCfg;            /*!< Port common configuration */
        netc_swt_port_bridge_config_t bridgeCfg; /*!< Port bridge configuration */
        netc_swt_port_fm_config_t fmCfg;         /*!< Port Frame Modification configuration */
        netc_port_tx_tc_config_t
            txTcCfg[8]; /*!< Port Tx traffic class related configuration, vaild only on port 0 ~ 3 */
        uint8_t
            ipvToTC[8]; /*!< Port IPV to Tx traffic class queue index mapping, value means TC index, range in 0 ~ 7 */
        uint8_t ipvToBP[8];               /*!< Port IPV to buffer pool ID mapping, value means BP ID, range in 0 ~
                                             (SWT_GetBPTableEntryNum() - 1) */
        netc_port_psfp_isi_config isiCfg; /*!< Port Ingress stream identification */
        bool enMirror;                    /*!< Enable/Disable Ingress Mirroring on this port */
        uint8_t lanID;                    /*!< The HSR's LANID this port belong to */
        bool inCutThrough;     /*!< Enable/Disable Ingress Cut Through on this port, vaild only on port 0 ~ 3 */
        bool outCutThrough;    /*!< Enable/Disable Egress Cut Through on this port, vaild only on port 0 ~ 3 */
#if defined(NETC_PORT_PCTFCR_BSQS_MASK)
        uint8_t outBufferSize; /*!< Specifies the minimal frame data buffered in words (24B) before the frame can be Cut
                                  Through out an egress port, range in 1 ~ 3, vaild only on port 0 ~ 3 */
#endif
        bool enableTg;         /*!< Enable port time gate scheduling. */
        bool enTxRx; /*!< Enable port transmit/receive path, if disabled, the tx/rx of the mac corresponding to the port
                        will also be closed. */
    } ports[5];      /*!< The common configuration required for all ports */
    uint16_t dynFDBLimit; /*!< Maximum number of entries which can be dynamically learned by FDB table, a value of 0
                             implies no limit. */
    netc_swt_psfp_config_t psfpCfg;          /*!< The switch PSFP configuration, cover the ISI key construction
                                                 profiles configuration */
    netc_ipf_config_t ipfCfg;                /*!< The switch ingress port filter configuration */
    netc_vlan_classify_config_t vlanCfg;     /*!< The switch ingress vlan classify configuration */
    netc_swt_qos_classify_config_t rxqosCfg; /*!< The switch ingress VLAN to QoS mapping configuration */
    netc_swt_qos_to_vlan_config_t txqosCfg;  /*!< The switch egress QoS to VLAN mapping configuration */
    netc_swt_imr_config_t imrCfg;            /*!< The switch Ingress mirror configuration */
    netc_swt_bridge_config_t bridgeCfg;      /*!< The switch bridge configuration */
    uint8_t cmdRingUse;                      /*!< Number of command BD rings to be used */
    netc_cmd_bdr_config_t cmdBdrCfg[2];      /*!< The switch command BD rings configuration */
    netc_msix_entry_t *msixEntry;            /*!< MSIX table entry array. */
    uint8_t entryNum;                        /*!< MSIX entry number. */
    uint8_t cmdBdrEntryIdx[2];               /*!< MSIX entry index of command BD ring interrupt. */
    uint8_t timeCaptureEntryIdx;             /*!< MSIX entry index of time capture interrupt. */
} swt_config_t;

/*! @brief Configuration constant structure for Switch in handle. */
typedef struct _swt_config_const
{
    uint8_t cmdRingUse;               /*!< Number of command BD rings to be used */
    uint8_t entryNum;                 /*!< MSIX entry number. */
    bool rxCacheMaintain : 1;         /*!< Enable/Disable Rx buffer cache maintain in driver. */
    bool txCacheMaintain : 1;         /*!< Enable/Disable Tx buffer cache maintain in driver. */
    bool enUseMgmtRxBdRing : 1;       /*!< Enable/Disable use Switch management Rx BD ring. */
#if !(defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG)
    bool enUseMgmtTxBdRing : 1;       /*!< Enable/Disable use Switch management Tx BD ring. */
#endif
    bool rxZeroCopy : 1;              /*!< Enable zero-copy receive mode. */
    swt_rx_alloc_cb_t rxBuffAlloc;    /*!< Callback function to alloc memory, must be provided for zero-copy Rx. */
    swt_rx_free_cb_t rxBuffFree;      /*!< Callback function to free memory, must be provided for zero-copy Rx. */
    swt_reclaim_cb_t reclaimCallback; /*!< Callback for reclaimed Tx Switch management frames. */
    void *userData;                   /*!< User data, return in callback. */
} swt_config_const_t;

/*! @brief Handle for SWITCH */
struct _swt_handle
{
    netc_switch_hw_t hw;         /*!< Hardware register map resource. */
    swt_config_const_t cfg;      /*!< Switch configuration constant. */
    netc_cmd_bdr_t cmdBdRing[2]; /*!< Command BD ring handle for switch. */
    ep_handle_t *epHandle;       /*!< The EP handle to send/receive management frame. */
    netc_rx_bdr_t mgmtRxBdRing;  /*!< Management Receive BD ring for frames with Host Reason filed not zero. */
    netc_tx_bdr_t mgmtTxBdRing;  /*!< Management Transmit BD ring for Direct Switch Enqueue frames. */
};

/*! @} */ // end of netc_swt_init
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_init
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_interrupt
#endif
/*! @addtogroup netc_swt_interrupt
 * @{
 */

/*! @} */ // end of netc_swt_interrupt
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_interrupt
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_xfer
#endif
/*! @addtogroup netc_swt_xfer
 * @{
 */
/*! @brief Switch management Tx parameter */
typedef union _swt_mgmt_tx_arg_t
{
    uint8_t ring; /*!< Tx ring index, use for Switch Port masquerading Tx option */
    struct
    {
        uint8_t ipv : 3; /*!< Internal Priority Value, use for Direct Switch Enqueue Tx option */
        uint8_t dr : 1;  /*!< Discard Resiliance, use for Direct Switch Enqueue Tx option */
        uint8_t : 4;
    };
} swt_mgmt_tx_arg_t;

#if defined(FSL_FEATURE_NETC_HAS_SWITCH_TAG) && FSL_FEATURE_NETC_HAS_SWITCH_TAG
/*! @brief Switch management Tx Option flags */
typedef enum _swt_mgmt_tx_opt_flags
{
    kSWT_TX_OPT_VLAN_INSERT = 0x1U, /*!< Enable VLAN insert, only active when use Switch Port masquerading Tx option. */
    kSWT_TX_OPT_OFFLOAD     = 0x2U  /*!< Tx offload. */
} swt_mgmt_tx_opt_flags;

