tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.h
/*!
 * @brief Get ingress stream count statistic
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetISCStatistic(swt_handle_t *handle, uint32_t entryID, netc_tb_isc_stse_t *statistic);

/*!
 * @brief Reset the count of the ingress stream count
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPResetISCStatistic(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number of stream gate instance table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetSGITableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->SGIITCAPR & NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->SGIITOR & NETC_SW_ENETC_SGIITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Get maximum entry number of stream gate instance table
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetSGITableMaxEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->SGIITCAPR & NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry in stream gate instance table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddSGITableEntry(swt_handle_t *handle, netc_tb_sgi_config_t *config);

/*!
 * @brief Reset IRX and OEX flag in stream gate instance entry
 *
 * @param handle
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPResetIRXOEXSGITableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Update entry in stream gate instance table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPUpdateSGITableEntry(swt_handle_t *handle, netc_tb_sgi_config_t *config);

/*!
 * @brief Delete entry in stream gate instance table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelSGITableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get state of the stream gate instance for specified entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetSGIState(swt_handle_t *handle, uint32_t entryID, netc_tb_sgi_sgise_t *state);

/*!
 * @brief Query entry in the stream gate instance table
 *
 * @param handle
 * @param entryID
 * @param config
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPQuerySGITableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_sgi_config_t *config);

/*!
 * @brief Get remaining available words number of Stream Gate Control List table
 * @note This is a dynamic bounded index table, and number of words required for a stream gate
 *       control list is 1+N/2 where N is number of gate time slots in the stream gate control list.
 *       The remaining word should be greater than the want added entry size
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetSGCLTableRemainWordNum(swt_handle_t *handle)
{
    return (handle->hw.common->SGCLITCAPR & NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->SGCLTMOR & NETC_SW_ENETC_SGCLTMOR_NUM_WORDS_MASK);
}

/*!
 * @brief Get maximum words number of Stream Gate Control List table
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_RxPSFPGetSGCLTableMaxWordNum(swt_handle_t *handle)
{
    return (handle->hw.common->SGCLITCAPR & NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_MASK);
}

/*!
 * @brief Add entry into Stream Gate Control List Table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPAddSGCLTableEntry(swt_handle_t *handle, netc_tb_sgcl_gcl_t *config);

/*!
 * @brief Delete entry of Stream Gate Control List Table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPDelSGCLTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get Stream Gate Control List Table entry gate control list
 *
 * @param handle
 * @param gcl
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetSGCLGateList(swt_handle_t *handle, netc_tb_sgcl_gcl_t *gcl, uint32_t length);

/*!
 * @brief Get state (ref count) for Stream Gate Control List table entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_RxPSFPGetSGCLState(swt_handle_t *handle, uint32_t entryID, netc_tb_sgcl_sgclse_t *state);

/*! @} */ // end of netc_swt_rx
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_rx
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_mgt
#endif
/*! @addtogroup netc_swt_mgt
 * @{
 */

/*!
 * @brief Config the Bridge
 *
 * Cover configuration below
 * - Vlan filter table default VFHTDRCR0-2
 *
 * Not Cover
 * - Port specific Vlan config
 * - Port Storm Control BPSCR0/R1
 * - FDB entry
 * - Vlan Filter Table entry
 * - Multicast filter entry
 *
 * @param handle
 * @param config
 * @return status_t
 */
status_t SWT_BridgeInit(swt_handle_t *handle, const netc_swt_bridge_config_t *config);

/*!
 * @brief Config bridge port vlan Tx/Rx
 *
 * Cover configuration below
 * - Port specific Vlan config
 * - Port Storm Control BPSCR0/R1
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
status_t SWT_BridgeConfigPort(swt_handle_t *handle,
                              netc_hw_port_idx_t portIdx,
                              const netc_swt_port_bridge_config_t *config);

/*!
 * @brief Config bridge port default VID
 *
 * @param handle
 * @param portIdx
 * @param vid
 * @return status_t
 */
status_t SWT_BridgeConfigPortDefaultVid(swt_handle_t *handle, netc_hw_port_idx_t portIdx, uint16_t vid);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of bridge vlan filter table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification, Ingress Stream Filter, FDB, L2 IPV4 Multicast Filter table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_BridgeGetVFTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add entry into bridge vlan filter table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeAddVFTableEntry(swt_handle_t *handle, netc_tb_vf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in bridge vlan filter table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeUpdateVFTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_vf_cfge_t *cfg);

/*!
 * @brief Query an entry in bridge VF Table
 *
 * @param handle
 * @param keye
 * @param rsp
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeQueryVFTableEntry(swt_handle_t *handle, netc_tb_vf_keye_t *keye, netc_tb_vf_rsp_data_t *rsp);

/*!
 * @brief Delete entry in bridge vlan filter table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeDelVFTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Search entry in bridge vlan filter table
 *
 * @note Only support search and return one entry at a time.
 *
 * @param handle
 * @param sCriteria
 * @param rsp
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeSearchVFTableEntry(swt_handle_t *handle,
                                      netc_tb_vf_search_criteria_t *sCriteria,
                                      netc_tb_vf_rsp_data_t *rsp);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of bridge FDB table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification, Ingress Stream Filter, VLAN Filter, L2 IPV4 Multicast Filter table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_BridgeGetFDBTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add entry into bridge FDB table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeAddFDBTableEntry(swt_handle_t *handle, netc_tb_fdb_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in bridge FDB table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeUpdateFDBTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_fdb_cfge_t *cfg);

/*!
 * @brief Query an entry in bridge FDB Table
 *
 * @param handle
 * @param keye
 * @param rsp
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeQueryFDBTableEntry(swt_handle_t *handle, netc_tb_fdb_keye_t *keye, netc_tb_fdb_rsp_data_t *rsp);

/*!
 * @brief Search entry in bridge FDB table
 *
 * @note Only support search and return one entry at a time.
 *
 * @param handle
 * @param sCriteria
 * @param rsp
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeSearchFDBTableEntry(swt_handle_t *handle,
                                       netc_tb_fdb_search_criteria_t *sCriteria,
                                       netc_tb_fdb_rsp_data_t *rsp);

/*!
 * @brief Delete an entry in bridge FDB Table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeDelFDBTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get the activity data for FDB table entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeGetFDBActivityState(swt_handle_t *handle, uint32_t entryID, netc_tb_fdb_acte_t *state);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of bridge L2 IPV4 multicast filter table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification, Ingress Stream Filter, VLAN Filter, FDB table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_BridgeGetL2MCFTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add entry into Bridge L2 IPV4 multicast filter table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeAddL2MCFTableEntry(swt_handle_t *handle, netc_tb_l2mcf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in bridge L2 IPV4 multicast filter table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeUpdateL2MCFTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_l2mcf_cfge_t *cfg);

/*!
 * @brief Search entry in bridge L2 IPV4 multicast filter table
 *
 * @note Only support search and return one entry at a time.
 *
 * @param handle
 * @param sCriteria
 * @param rsp
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeSearchL2MCFTableEntry(swt_handle_t *handle,
                                         netc_tb_l2mcf_search_criteria_t *sCriteria,
                                         netc_tb_l2mcf_rsp_data_t *rsp);

/*!
 * @brief Get the activity data for bridge L2 IPV4 multicast filter table entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeGetL2MCFActivityState(swt_handle_t *handle, uint32_t entryID, netc_tb_l2mcf_acte_t *state);

/*!
 * @brief Delete entry in bridge L2 IPV4 multicast filter table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_BridgeDelL2MCFTableEntry(swt_handle_t *handle, uint32_t entryID);

// Frame Modification
/*!
 * @brief Config Port level Frame Modification
 *
 * @param handle
 * @param portIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_FMConfigPort(swt_handle_t *handle,
                                        netc_hw_port_idx_t portIdx,
                                        const netc_swt_port_fm_config_t *config)
{
    NETC_PORT_Type *base = handle->hw.ports[portIdx].port;
    base->PFMCR          = NETC_PORT_PFMCR_FMMA(config->ignoreFMMiscfg);
    base->PPCPDEIMR =
        NETC_PORT_PPCPDEIMR_DRME(config->enUpdateVlanDei) | NETC_PORT_PPCPDEIMR_EPCPMPV(config->enEgressPcpMap) |
        NETC_PORT_PPCPDEIMR_EPCPMP(config->egressPcpMap) | NETC_PORT_PPCPDEIMR_IPCPMPV(config->enIngressPcpMap) |
        NETC_PORT_PPCPDEIMR_IPCPMP(config->ingressPcpMap) |
        (((uint32_t)config->drToDeiMap & 0xFU) << NETC_PORT_PPCPDEIMR_DR0DEI_SHIFT);
    base->PQOSMR = (base->PQOSMR & ~NETC_PORT_PQOSMR_QVMP_MASK) | NETC_PORT_PQOSMR_QVMP(config->qosVlanMap);
    return kStatus_Success;
}

/*!
 * @brief Get remaining available entry number of Frame Modification table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FMGetTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->FMITCAPR & NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->FMITOR & NETC_SW_ENETC_FMITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Get maximum entry number of Frame Modification table
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FMGetTableMaxEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->FMITCAPR & NETC_SW_ENETC_FMITCAPR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry into the Frame Modification table
 *
 * Add entry of the frame modification table. Frame modification can be encoded into the table id directly or provided
 * as index of the table entry. refer to the frame modification entry definition.
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMAddTableEntry(swt_handle_t *handle, netc_tb_fm_config_t *config);

/*!
 * @brief Update entry in the Frame Modification table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMUpdateTableEntry(swt_handle_t *handle, netc_tb_fm_config_t *config);

/*!
 * @brief Delete table entry in Frame Modification Table
 *
 * The provided ID must be table index. Error return if the id is action encoded id.
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMDelTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Query table entry in Frame Modification Table
 *
 * The provided ID must be table index. Error return if the id is action encoded id.
 *
 * @param handle
 * @param entryID
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMQueryTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_fm_config_t *config);

/*!
 * @brief Get word number (word size is 24  bytes) of Frame Modification data table
 * @note This is a static bounded index table, when update or query table, should satisifed:
 *       numBytes + ENTRY_ID <= 24 * wordNumber .
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FMDGetTableWordsNum(swt_handle_t *handle)
{
    return handle->hw.common->FMDITCAPR & NETC_SW_ENETC_FMDITCAPR_NUM_WORDS_MASK;
}

/*!
 * @brief Update Frame Modification data table contents
 *
 * @param handle
 * @param config
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMDUpdateTableEntry(swt_handle_t *handle, netc_tb_fmd_update_config_t *config, uint32_t length);
/*!
 * @brief Query Frame Modification data table contents
 *
 * @param handle
 * @param query
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FMDQueryTableEntry(swt_handle_t *handle, netc_tb_fmd_query_buffer_t *query, uint32_t length);

/*!
 * @brief Get remaining available entry number of ingress Sequence Generation table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FRERGetISEQGTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->ISQGITCAPR & NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->ISQGITOR & NETC_SW_ENETC_ETTOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry into FRER sequence number generation table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERAddISEQGTableEntry(swt_handle_t *handle, netc_tb_iseqg_config_t *config);

/*!
 * @brief Update entry in FRER sequence number generation table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERUpdateISEQGTableEntry(swt_handle_t *handle, netc_tb_iseqg_config_t *config);

/*!
 * @brief Reset sequence number generation in FRER sequence generation entry
 *
 * @param handle
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERResetSEQGTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Delete entry in FRER sequence number generation table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERDelISEQGTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get the Sequence generation number form sequence generation table for specified entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERGetISEQGState(swt_handle_t *handle, uint32_t entryID, netc_tb_iseqg_sgse_t *state);

/*!
 * @brief Get the number of entries assigned to FRER sequence number recovery table
 * @note This is a static bounded index table, so all entries in the table are available for
 *       SWT_FRERConfigESEQRTableEntry() API
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_FRERGetESEQRTableEntryNum(swt_handle_t *handle)
{
    return handle->hw.common->ESQRTCAPR & NETC_SW_ENETC_ESQRTCAPR_NUM_ENTRIES_MASK;
}

/*!
 * @brief Config FRER sequence number recovery table entry
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERConfigESEQRTableEntry(swt_handle_t *handle, netc_tb_eseqr_config_t *config);

/*!
 * @brief Query FRER sequence recovery table entry
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @param config
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERQueryESEQRTableEntry(swt_handle_t *handle,
                                      uint32_t entryID,
                                      netc_tb_eseqr_stse_t *statistic,
                                      netc_tb_eseqr_cfge_t *config,
                                      netc_tb_eseqr_srse_t *state);

/*!
 * @brief Get FRER sequence recorvery table state and statistic
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_FRERGetESEQRStatistic(swt_handle_t *handle,
                                   uint32_t entryID,
                                   netc_tb_eseqr_stse_t *statistic,
                                   netc_tb_eseqr_srse_t *state);

/*!
 * @brief Get Buffer Pool table entry number
 * @note This is a static bounded index table, so all entries in the table are available for
 *       SWT_UpdateBPTableEntry() API
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_GetBPTableEntryNum(swt_handle_t *handle)
{
    return handle->hw.base->BPCAPR & NETC_SW_BPCAPR_NUM_BP_MASK;
}

/*!
 * @brief Update Buffer Pool table entry
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_UpdateBPTableEntry(swt_handle_t *handle, netc_tb_bp_config_t *config);

/*!
 * @brief Get Buffer Pool table entry State
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_GetBPEntryState(swt_handle_t *handle, uint32_t entryID, netc_tb_bp_bpse_t *state);

/*!
 * @brief Get Shared Buffer Pool table entry number
 * @note This is a static bounded index table, so all entries in the table are available for
 *       SWT_UpdateSBPTableEntry() API
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_GetSBPTableEntryNum(swt_handle_t *handle)
{
    return (handle->hw.base->BPCAPR & NETC_SW_BPCAPR_NUM_SPB_MASK) >> NETC_SW_BPCAPR_NUM_SPB_SHIFT;
}

/*!
 * @brief Update Shared Buffer Pool table entry
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_UpdateSBPTableEntry(swt_handle_t *handle, netc_tb_sbp_config_t *config);

/*!
 * @brief Get Shared Buffer Pool table entry State
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_GetSBPEntryState(swt_handle_t *handle, uint32_t entryID, netc_tb_sbp_sbpse_t *state);

