tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/netc/fsl_netc_switch.h
/*! @} */ // end of netc_swt_mgt
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_swt_mgt
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_swt_tx
#endif
/*! @addtogroup netc_swt_tx
 * @{
 */

/*!
 * @brief Configure the transmit maximum SDU for port Traffic Class
 *
 * @param handle
 * @param portIdx
 * @param tcIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_TxSDUConfigPort(swt_handle_t *handle,
                                           netc_hw_port_idx_t portIdx,
                                           netc_hw_tc_idx_t tcIdx,
                                           const netc_port_tc_sdu_config_t *config)
{
    assert((handle != NULL) && (config != NULL));

    return NETC_PortConfigTcMaxSDU(handle->hw.ports[portIdx].port, tcIdx, config);
}

/*!
 * @brief Configure the Credit Based Shaper for port Traffic Class
 *
 * @param handle
 * @param portIdx
 * @param tcIdx
 * @param config
 * @return status_t
 */
static inline status_t SWT_TxCBSConfigPort(swt_handle_t *handle,
                                           netc_hw_port_idx_t portIdx,
                                           netc_hw_tc_idx_t tcIdx,
                                           const netc_port_tc_cbs_config_t *config)
{
    assert((handle != NULL) && (config != NULL));

    return NETC_PortConfigTcCBS(handle->hw.ports[portIdx].port, tcIdx, config);
}

/*!
 * @brief Config the Time Gate Scheduling entry admin gate control list
 *
 * This function is used to program the Enhanced Scheduled Transmisson. (IEEE802.1Qbv)
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxTGSConfigAdminGcl(swt_handle_t *handle, netc_tb_tgs_gcl_t *config);

/*!
 * @brief Get Time Gate Scheduling entry operation gate control list
 *
 * This function is used to read the Enhanced Scheduled Transmisson. (IEEE802.1Qbv)
 *
 * @param handle
 * @param gcl
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxtTGSGetOperGcl(swt_handle_t *handle, netc_tb_tgs_gcl_t *gcl, uint32_t length);

/*!
 * @brief Config the TC (traffic class) property
 *
 * @param handle
 * @param portIdx
 * @param tcIdx
 * @param config
 * @return status_t
 */
status_t SWT_TxTrafficClassConfig(swt_handle_t *handle,
                                  netc_hw_port_idx_t portIdx,
                                  netc_hw_tc_idx_t tcIdx,
                                  const netc_port_tx_tc_config_t *config);

/*!
 * @brief Enable the switch port time gate scheduling
 *
 * @param handle
 * @param portIdx
 * @param enable
 * @param gateState
 * @return status_t
 */
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
status_t SWT_TxPortTGSEnable(swt_handle_t *handle, netc_hw_port_idx_t portIdx, bool enable, uint8_t gateState);
#else
status_t SWT_TxPortTGSEnable(swt_handle_t *handle, netc_hw_port_idx_t portIdx, bool enable);
#endif

/*!
 * @brief Get remaining available entry number of egress treatment table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t SWT_TxEPPGetETTableRemainEntryNum(swt_handle_t *handle)
{
    return (handle->hw.common->ETTCAPR & NETC_SW_ENETC_ETTCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->ETTOR & NETC_SW_ENETC_ETTOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry in the egress treatment table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxEPPAddETTableEntry(swt_handle_t *handle, netc_tb_et_config_t *config);

/*!
 * @brief Update entry in the egress treatment table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxEPPUpdateETTableEntry(swt_handle_t *handle, netc_tb_et_config_t *config);

/*!
 * @brief Query an entry in the egress treatment table
 *
 * @param handle
 * @param entryID
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxEPPQueryETTableEntry(swt_handle_t *handle, uint32_t entryID, netc_tb_et_config_t *config);

/*!
 * @brief Delete entry for the egress treatment table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxEPPDelETTableEntry(swt_handle_t *handle, uint32_t entryID);

/*!
 * @brief Configure switch egress QOS to VLAN map classification
 *
 * @param handle
 * @param config
 * @return status_t
 */
status_t SWT_TxEPPQosToVlanConfig(swt_handle_t *handle, const netc_swt_qos_to_vlan_config_t *config);

/*!
 * @brief Configure the WBFS and Strict priority for each PORT by using ETM Class Scheduler table
 *
 * @note There is one class queue scheduler per switch port, and there is limitation between TSD and class queue
 *       scheduler configuration
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxETMConfigClassScheduler(swt_handle_t *handle, netc_tb_etmcs_config_t *config);

/*!
 * @brief Configure the class queue to congestion group map by using ETM class queue table
 * @note The number of class queue table entry is equal to the number of class queues in the switch
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxETMConfigClassQueue(swt_handle_t *handle, netc_tb_etmcq_config_t *config);

/*!
 * @brief Config congestion group map by using ETM congestion group table
 * @note The number of congestion groups table entry is equal to the number of class queues in the switch
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t SWT_TxETMConfigCongestionGroup(swt_handle_t *handle, netc_tb_etmcg_config_t *config);

/*!
 * @brief Config Preemption for each port TC (traffic class)
 *
 * @param handle
 * @param portIdx
 * @param tcIdx
 * @param enable
 */
static inline void SWT_TxTcConfigPreemption(swt_handle_t *handle,
                                            netc_hw_port_idx_t portIdx,
                                            netc_hw_tc_idx_t tcIdx,
                                            const bool enable)
{
    NETC_PORT_Type *base;

    base = handle->hw.ports[portIdx].port;
    if (!NETC_PortIsPseudo(base))
    {
        NETC_PortConfigTcPreemption(base, tcIdx, enable);
    }
}

/*!
 * @brief Get Preemption configuration for each port TC (traffic class)
 *
 * @param handle
 * @param portIdx
 * @param tcIdx
 * @param enabled
 */
static inline void SWT_TxGetTcPreemption(swt_handle_t *handle,
                                         netc_hw_port_idx_t portIdx,
                                         netc_hw_tc_idx_t tcIdx,
                                         bool *enabled)
{
    NETC_PORT_Type *base;

    base = handle->hw.ports[portIdx].port;
    if (!NETC_PortIsPseudo(base))
    {
        NETC_PortGetTcPreemption(base, tcIdx, enabled);
    }
}

/*!
 * @brief Configure Preemption control configuration for an ethernet MAC
 *
 * @param handle
 * @param portIdx
 * @param config
 */
static inline void SWT_TxPortEthMacConfigPreemption(swt_handle_t *handle,
                                                    netc_hw_port_idx_t portIdx,
                                                    const netc_port_preemption_config *config)
{
    NETC_ETH_LINK_Type *base;

    base = handle->hw.ports[portIdx].eth;
    NETC_PortConfigEthMacPreemption(base, config);
}

/*!
 * @brief Get Preemption control configuration from ethernet MAC port
 *
 * @param handle
 * @param portIdx
 * @param config
 */
static inline void SWT_TxPortGetEthMacPreemption(swt_handle_t *handle,
                                                 netc_hw_port_idx_t portIdx,
                                                 netc_port_preemption_config *config,
                                                 netc_port_phy_mac_preemption_status_t *status)
{
    NETC_ETH_LINK_Type *base;

    base = handle->hw.ports[portIdx].eth;

    NETC_PortGetPhyMacPreemptionControl(base, config);

    NETC_PortGetPhyMacPreemptionStatus(base, status);
}

